In [7]:
import pandas as pd
import numpy as np

In [ ]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [5]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [8]:
df = pd.DataFrame(data=d, dtype=np.int8)
df.dtypes

col1    int8
col2    int8
dtype: object

In [ ]:
#INT8 = -128 ATÉ 127 - 8 BITS
#INT64 = 64 BITS - 9 TRILHÕES

In [14]:
d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

In [ ]:
#numpy - 
df2 = pd.DataFrame( np.array( [ [1, 2, 3], [4, 5, 6], [7, 8, 9] ] ),
                    columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
np.array( [ [1, 2, 3], [4, 5, 6], [7, 8, 9] ] )

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [ ]:
#tuplas
data = np.array( [ (1, 2, 3), (4, 5, 6), (7, 8, 9) ] ,
                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")]) #i4 - 4bytes (equivalente a int32)
df3 = pd.DataFrame(data, columns=['c', 'a'])
df3

   c  a
0  3  1
1  6  4
2  9  7

In [ ]:
ser = pd.Series( [1, 2, 3] , index=["a", "b", "c"])
df = pd.DataFrame(data=ser, index=["a", "c"])
df

   0
a  1
c  3

In [20]:
ser

a    1
b    2
c    3
dtype: int64

In [ ]:
df1 = pd.DataFrame( [1, 2, 3] , index=["a", "b", "c"], columns=["x"])
df2 = pd.DataFrame( data=df1, index=["a", "c"])
df2

   x
a  1
c  3

In [22]:
df1

   x
a  1
b  2
c  3